Revit 2027 API
BuiltInFailures.SketchFailures.SubregionNoHostSurf Property
 A Subregion cannot be created outside the boundary of a Toposurface. A Subregion should be completely inside a Toposurface or overlap a Toposurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SubregionNoHostSurf { get; }
Public Shared ReadOnly Property SubregionNoHostSurf As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SubregionNoHostSurf {
	FailureDefinitionId^ get ();
}
static member SubregionNoHostSurf : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace